test/jmeter/showtime_business_only.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Showtime 业务链路压测（预热 token）" enabled="true">
      <stringProp name="TestPlan.comments">业务链路压测：锁座→下单（token 由 warmup_tokens.py 预热/刷新，绕开 login 5/min/IP 限流）。
可调参数（-J 覆盖）：DOMAIN/PORT/PROTOCOL（默认 localhost/5146/http）、THREADS（默认 50）、LOOPS（默认 1）、RAMP_UP（默认 60）、TOKEN_FILE（默认 out/tokens.csv）、PLAN_FILE（默认 out/plan.csv）。
前置数据：TOKEN_FILE 每行 account,accessToken,refreshToken,expiresAtUtc（多线程复用同一批 token，受认证用户 120/min/人 全局限流约束）；PLAN_FILE 每行 sessionId,seatId,priceStrategyId,seatNo,section，行数必须 ≥ THREADS（由 generate_load_plan.py 生成，priceStrategyId 已按座位所在区匹配）。</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <!-- 线程组：每线程从 PLAN_FILE 取一行（座位唯一，避免抢座），从 TOKEN_FILE 轮转取 token（多线程复用） -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="业务链路压测（锁座→下单）" enabled="true">
        <stringProp name="TestPlan.comments">THREADS 必须等于 PLAN_FILE 行数；LOOPS 默认 1</stringProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="循环控制器" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${__P(LOOPS,1)}</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(THREADS,50)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(RAMP_UP,60)}</stringProp>
      </ThreadGroup>

      <hashTree>
        <!-- 预热 token（多线程轮转复用同一批账号 token） -->
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="预热 Token 数据" enabled="true">
          <stringProp name="fileEncoding">UTF-8</stringProp>
          <stringProp name="filename">${__P(TOKEN_FILE,out/tokens.csv)}</stringProp>
          <stringProp name="variableNames">account,accessToken</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <boolProp name="recycle">true</boolProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="delimiter">,</stringProp>
        </CSVDataSet>
        <hashTree></hashTree>

        <!-- 座位分配计划（每线程一行，座位/场次/定价策略唯一） -->
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="座位分配计划" enabled="true">
          <stringProp name="fileEncoding">UTF-8</stringProp>
          <stringProp name="filename">${__P(PLAN_FILE,out/plan.csv)}</stringProp>
          <stringProp name="variableNames">sessionId,seatId,priceStrategyId</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <boolProp name="recycle">false</boolProp>
          <boolProp name="stopThread">true</boolProp>
          <stringProp name="delimiter">,</stringProp>
        </CSVDataSet>
        <hashTree></hashTree>

        <!-- HTTP 请求默认值 -->
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP 请求默认值" enabled="true">
          <stringProp name="HTTPSampler.domain">${__P(DOMAIN,localhost)}</stringProp>
          <stringProp name="HTTPSampler.port">${__P(PORT,5146)}</stringProp>
          <stringProp name="HTTPSampler.protocol">${__P(PROTOCOL,http)}</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <stringProp name="HTTPSampler.connect_timeout">10000</stringProp>
          <stringProp name="HTTPSampler.response_timeout">180000</stringProp>
        </ConfigTestElement>
        <hashTree></hashTree>

        <!-- 全局 HTTP 头 -->
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP 头管理器" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree></hashTree>

        <!-- 鉴权头（预热 token） -->
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Bearer 鉴权头" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer ${accessToken}</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree></hashTree>

        <!-- 1. 锁座（POST /api/sessions/{sessionId}/seat-locks） -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="1. 锁座" enabled="true">
          <stringProp name="HTTPSampler.path">/api/sessions/${sessionId}/seat-locks</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <stringProp name="HTTPSampler.connect_timeout">10000</stringProp>
          <stringProp name="HTTPSampler.response_timeout">180000</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{"seatIds":[${seatId}]}</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>

        <hashTree>
          <!-- 提取锁座接口返回的 lockToken，供下单使用 -->
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="提取 LockToken" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">lockToken</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.data.locks[0].lockToken</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
          </JSONPostProcessor>
          <hashTree></hashTree>

          <!-- 锁座响应断言 -->
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="锁座响应断言" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="-1349267989">"success":true</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.ignore_status">0</intProp>
          </ResponseAssertion>
          <hashTree></hashTree>
        </hashTree>

        <!-- 2. 下单（携带真实 lockToken；priceStrategyId 已按座位所在区匹配） -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="2. 下单" enabled="true">
          <stringProp name="HTTPSampler.path">/api/orders</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <stringProp name="HTTPSampler.connect_timeout">10000</stringProp>
          <stringProp name="HTTPSampler.response_timeout">180000</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{"sessionId":${sessionId},"items":[{"seatId":${seatId},"priceStrategyId":${priceStrategyId},"lockToken":"${lockToken}"}],"remark":"load-test"}</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>

        <hashTree>
          <!-- 幂等键（必填，≤64 字符）：用本欢锁座返回的 lockToken（每次唯一） -->
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Idempotency-Key" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Idempotency-Key</stringProp>
                <stringProp name="Header.value">${lockToken}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree></hashTree>
          <!-- 下单响应断言 -->
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="下单响应断言" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="-1349267989">"success":true</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.ignore_status">0</intProp>
          </ResponseAssertion>
          <hashTree></hashTree>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>